OdBrepParams.setToleranceStatic(System.Double)
\details
Sets a new tolerance static coefficient value.
\param toleranceCoef [in] A new tolerance static coefficient value.

OdBrepParams.getToleranceStatic
\details
Retrieves the current static tolerance coefficient value.
\returns A double value that represents the current static tolerance coefficient.

OdBrepParams.setToleranceDynamic(System.Double)
\details
Sets a new dynamic tolerance coefficient value.
\param toleranceCoef [in] A new dynamic tolerance coefficient value.

OdBrepParams.getToleranceDynamic
\details
Retrieves the current dynamic tolerance coefficient value.
\returns A double value that represents the current dynamic tolerance coefficient.

OdBrepParams.setToleranceType(OdBrepParams.ToleranceType)
\details
Sets a new surface tolerance calculation method value for the parameters set.
\param toleranceType [in] A new surface tolerance calculation method value to be set.

OdBrepParams.getToleranceType
\details
Retrieves the current surface tolerance calculation method.
\returns A value that represents the current surface tolerance calculation method.

OdBrepParams.#ctor(OdBrepParams.ToleranceType,System.Double,System.Double)
\details
Creates a new set of brep parameters with the specified values.
\param toleranceType    [in] Type of surface tolerance calculation method.
\param toleranceDynamic [in] Coefficient value for dynamic surface tolerance calculation method.
\param toleranceStatic  [in] Coefficient value for static surface tolerance calculation method.

OdBrepParams
\details
A class that implements work with brep geometry parameters.